/*
Navicat MySQL Data Transfer

Source Server         : yyy
Source Server Version : 50724
Source Host           : localhost:3306
Source Database       : song

Target Server Type    : MYSQL
Target Server Version : 50724
File Encoding         : 65001

Date: 2020-12-03 14:22:14
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for change_song
-- ----------------------------
DROP TABLE IF EXISTS `change_song`;
CREATE TABLE `change_song` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `current_id` int(20) DEFAULT NULL,
  `client_id` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of change_song
-- ----------------------------

-- ----------------------------
-- Table structure for current
-- ----------------------------
DROP TABLE IF EXISTS `current`;
CREATE TABLE `current` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `lrc` text,
  `start` bigint(20) DEFAULT NULL,
  `end` bigint(20) DEFAULT NULL,
  `current` int(10) DEFAULT NULL,
  `status` int(3) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=154 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of current
-- ----------------------------
INSERT INTO `current` VALUES ('153', '飞鸟和蝉', 'song/飞鸟和蝉.mp3', '[00:29.739]来得及\n[00:32.769]我们只剩回忆\n[00:35.860]窗外风景有你的印记\n[00:42.531]晚风来的只留有遗憾\n[00:45.806]也不让它去宠爱\n[00:49.593]用一句话 没必要再为难\n[00:56.113]在这里\n[00:59.158]不过是场宿命\n[01:03.667]留不住的才用力抗拒\n[01:08.834]手心长出纠缠的曲线\n[01:12.030]情动以后不过一天\n[01:14.986]盛放的蔷薇 贪恋只是气味\n[01:21.120]你悄悄地飞远\n[01:23.793]我的心太卑浅\n[01:27.428]回不去的昨天\n[01:30.027]变成一道碎片\n[01:33.887]海岸线 映出我们之间回忆光点\n[01:42.424]海之角 不再遥远\n[01:47.172]你悄悄地飞远\n[01:51.186]我对你太亏欠\n[01:53.249]回不去的夏天\n[01:56.563]我对你的思念\n[02:00.298]海岸线 映出我们之间回忆碎片\n[02:08.719]海之角 不再遥远\n[02:13.910]想念\n[02:28.222]在这里\n[02:31.566]不过是场宿命\n[02:34.015]留不住的才用力抗拒\n[02:40.719]手心长出纠缠的曲线                                              情动以后不过一天\n[02:46.827]盛放的蔷薇 贪恋只是气味\n[02:47.450]情动以后不过一天\n[02:53.741]你悄悄地飞远\n[02:57.318]我的心太卑浅\n[02:58.915]回不去的昨天\n[03:02.604]变成一道碎片\n[03:05.954]海岸线 映出我们之间回忆光点\n[03:14.245]海之角 不再遥远\n[03:19.203]你悄悄地飞远\n[03:22.154]我对你太亏欠\n[03:25.440]回不去的夏天\n[03:28.512]我对你的思念\n[03:32.347]海岸线 映出我们之间回忆碎片\n[03:40.572]海之角 不再遥远\n[03:46.056]想念\n[03:49.294]你悄悄地飞远\n[03:52.840]我的心太卑浅\n[03:55.131]回不去的昨天\n[03:58.033]变成一道碎片\n[04:01.748]海岸线 映出我们之间回忆光点\n[04:09.777]海之角 不再遥远\n[04:15.020]你悄悄地飞远\n[04:17.974]我对你太亏欠\n[04:22.434]回不去的夏天\n[04:24.297]我对你的思念\n[04:28.157]海岸线 映出我们之间回忆碎片\n[04:35.672]海之角 不再遥远\n[04:41.913]想念\n', '1606976255', '1606976555', '251', '2');

-- ----------------------------
-- Table structure for songs
-- ----------------------------
DROP TABLE IF EXISTS `songs`;
CREATE TABLE `songs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `lrc` text,
  `song_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of songs
-- ----------------------------
INSERT INTO `songs` VALUES ('3', '飞鸟和蝉', 'song/飞鸟和蝉.mp3', '[00:29.739]来得及\n[00:32.769]我们只剩回忆\n[00:35.860]窗外风景有你的印记\n[00:42.531]晚风来的只留有遗憾\n[00:45.806]也不让它去宠爱\n[00:49.593]用一句话 没必要再为难\n[00:56.113]在这里\n[00:59.158]不过是场宿命\n[01:03.667]留不住的才用力抗拒\n[01:08.834]手心长出纠缠的曲线\n[01:12.030]情动以后不过一天\n[01:14.986]盛放的蔷薇 贪恋只是气味\n[01:21.120]你悄悄地飞远\n[01:23.793]我的心太卑浅\n[01:27.428]回不去的昨天\n[01:30.027]变成一道碎片\n[01:33.887]海岸线 映出我们之间回忆光点\n[01:42.424]海之角 不再遥远\n[01:47.172]你悄悄地飞远\n[01:51.186]我对你太亏欠\n[01:53.249]回不去的夏天\n[01:56.563]我对你的思念\n[02:00.298]海岸线 映出我们之间回忆碎片\n[02:08.719]海之角 不再遥远\n[02:13.910]想念\n[02:28.222]在这里\n[02:31.566]不过是场宿命\n[02:34.015]留不住的才用力抗拒\n[02:40.719]手心长出纠缠的曲线                                              情动以后不过一天\n[02:46.827]盛放的蔷薇 贪恋只是气味\n[02:47.450]情动以后不过一天\n[02:53.741]你悄悄地飞远\n[02:57.318]我的心太卑浅\n[02:58.915]回不去的昨天\n[03:02.604]变成一道碎片\n[03:05.954]海岸线 映出我们之间回忆光点\n[03:14.245]海之角 不再遥远\n[03:19.203]你悄悄地飞远\n[03:22.154]我对你太亏欠\n[03:25.440]回不去的夏天\n[03:28.512]我对你的思念\n[03:32.347]海岸线 映出我们之间回忆碎片\n[03:40.572]海之角 不再遥远\n[03:46.056]想念\n[03:49.294]你悄悄地飞远\n[03:52.840]我的心太卑浅\n[03:55.131]回不去的昨天\n[03:58.033]变成一道碎片\n[04:01.748]海岸线 映出我们之间回忆光点\n[04:09.777]海之角 不再遥远\n[04:15.020]你悄悄地飞远\n[04:17.974]我对你太亏欠\n[04:22.434]回不去的夏天\n[04:24.297]我对你的思念\n[04:28.157]海岸线 映出我们之间回忆碎片\n[04:35.672]海之角 不再遥远\n[04:41.913]想念\n', '1474660964');
INSERT INTO `songs` VALUES ('5', '江南', 'song/江南.mp3', '[00:00.000] 作词 : 林秋离\n[00:00.000] 作曲 : 林俊杰\n[00:00.000]作曲 : 林俊杰\n[00:00.666]作词 : 林秋离\n[00:02.000]编曲 : 蔡政勋 / 陈建玮\n[00:03.000]\n[00:37.010]风到这里就是黏\n[00:40.534]黏住过客的思念\n[00:44.795]雨到了这里缠成线\n[00:48.546]缠着我们流连人世间\n[00:53.038]你在身边就是缘\n[00:56.569]缘分写在三生石上面\n[01:01.023]爱有万分之一甜\n[01:04.546]宁愿我就葬在这一点\n[01:09.062]圈圈圆圆圈圈\n[01:10.739]天天年年天天 的我\n[01:13.546]深深看你的脸\n[01:16.041]生气的温柔\n[01:17.994]埋怨的温柔 的脸\n[01:24.058]不懂爱恨情愁煎熬的我们\n[01:27.737]都以为相爱就像风云的善变\n[01:32.017]相信爱一天 抵过永远\n[01:36.279]在这一刹那冻结了时间\n[01:40.009]不懂怎么表现温柔的我们\n[01:43.760]还以为殉情只是古老的传言\n[01:47.751]离愁能有多痛 痛有多浓\n[01:52.247]当梦被埋在江南烟雨中\n[01:55.506]心碎了才懂\n[01:58.921]\n[02:20.982]圈圈圆圆圈圈\n[02:22.699]天天年年天天 的我\n[02:25.470]深深看你的脸\n[02:27.948]生气的温柔\n[02:29.933]埋怨的温柔 的脸\n[02:35.984]不懂爱恨情愁煎熬的我们\n[02:39.697]都以为相爱就像风云的善变\n[02:43.951]相信爱一天 抵过永远\n[02:48.195]在这一刹那冻结了时间\n[02:51.964]不懂怎么表现温柔的我们\n[02:55.694]还以为殉情只是古老的传言\n[02:59.698]离愁能有多痛 痛有多浓\n[03:04.200]当梦被埋在江南烟雨中\n[03:07.485]心碎了才懂\n[03:11.231]\n[03:19.925]相信爱一天 抵过永远\n[03:24.192]在这一刹那冻结了时间\n[03:27.952]不懂怎么表现温柔的我们\n[03:31.717]还以为殉情只是古老的传言\n[03:35.716]离愁能有多痛 痛有多浓\n[03:40.186]当梦被埋在江南烟雨中\n[03:45.494]心碎了才懂\n[03:49.162]\n[04:02.919]制作人：许环良\n[04:03.291]制作助理：冯时泽\n[04:03.546]箫：林信有\n[04:03.722]吉他：Shah Tahir\n[04:03.940]低音吉他：Gary Lao\n[04:04.135]和声编写：许环良\n[04:04.333]和声：林俊杰\n[04:04.522]录音室：The Garden（新加坡）\n[04:04.721]录音师：许环良、Acid Pang\n[04:04.939]混音室：Blue Moon Studio（加利福尼亚州）\n[04:05.196]混音师：Joe Vanelli、Joe Primeau with 许环良\n[04:05.409]OP：大潮音乐经纪有限公司/Touch Music Publishing Pte Ltd., Compass\n[04:05.569]SP：大潮音乐经纪有限公司\n[04:05.786]ISRC TW-B67-04-01206\n[04:06.278]\n', '26305527');
INSERT INTO `songs` VALUES ('6', '曹操', 'song/曹操.mp3', '[00:00.000] 作词 : 林秋离\n[00:01.000] 作曲 : 林俊杰\n[00:02.000]编曲 : Kenn C\n[00:03.000]\n[00:26.847]不是英雄 不读三国\n[00:33.491]若是英雄 怎么能不懂寂寞\n[00:39.701]独自走下长坂坡 月光太温柔\n[00:43.195]曹操不啰嗦 一心要拿荆州\n[00:46.795]用阴谋 阳谋 明说 暗夺的摸\n[00:53.461]东汉末年分三国\n[00:56.535]烽火连天不休\n[01:00.125]儿女情长 被乱世左右\n[01:05.132]谁来煮酒\n[01:06.777]尔虞我诈是三国\n[01:09.854]说不清对与错\n[01:13.444]纷纷扰扰 千百年以后\n[01:18.470]一切又从头\n[01:26.381]\n[01:33.488]不是英雄 不读三国\n[01:40.132]若是英雄 怎么能不懂寂寞\n[01:46.390]独自走下长坂坡 月光太温柔\n[01:49.857]曹操不啰嗦 一心要拿荆州\n[01:53.422]用阴谋 阳谋 明说 暗夺的摸\n[02:00.174]东汉末年分三国\n[02:03.212]烽火连天不休\n[02:06.801]儿女情长 被乱世左右\n[02:11.747]谁来煮酒\n[02:13.444]尔虞我诈是三国\n[02:16.552]说不清对与错\n[02:20.139]纷纷扰扰 千百年以后\n[02:25.139]一切又从头\n[02:31.219]\n[02:39.628]独自走下长坂坡 月光太温柔\n[02:43.173]曹操不啰嗦 一心要拿荆州\n[02:46.753]用阴谋 阳谋 明说 暗夺的谋\n[02:53.440]东汉末年分三国\n[02:56.538]烽火连天不休\n[03:00.111]儿女情长 被乱世左右\n[03:05.068]谁来煮酒\n[03:06.754]尔虞我诈是三国\n[03:09.823]说不清对与错\n[03:13.420]纷纷扰扰 千百年以后\n[03:18.447]一切又从头\n[03:26.743]\n', '26305534');
INSERT INTO `songs` VALUES ('7', '小跳蛙', 'song/小跳蛙.mp3', '[00:00.000] 作词 : 彭钧/李润\n[00:01.000] 作曲 : 彭钧\n[00:14.81]快乐池塘栽种了 梦想就变成海洋\n[00:18.73]鼓鼓的眼睛大嘴巴 同样唱的响亮\n[00:22.82]借我一双小翅膀 就能飞向太阳\n[00:26.76]我相信 奇迹就在身上\n[00:30.72]\n[00:31.05]啦......\n[00:36.94]有你相伴 leap frog\n[00:38.71]啦......\n[00:42.86]自信成长 有你相伴 leap frog\n[00:48.140]快乐的一只小青蛙 leap frog\n[00:51.470]快乐的一只小青蛙 leap frog\n[00:56.13]快乐的池塘里面有只小青蛙\n[01:00.00]它跳起舞来就像被王子附体了\n[01:03.76]酷酷的眼神 没有哪只青蛙能比美\n[01:08.07]总有一天它会被公主唤醒了\n[01:11.23]\n[01:12.08]啦...... leap frog\n[01:19.09]啦...... leap frog\n[01:27.42]\n[01:28.08]它是一只小跳蛙 越过蓝色大西洋\n[01:31.88]跳到遥远的东方 跳到我们身旁\n[01:35.85]春夏秋冬 我们是最好的伙伴\n[01:39.92]亲吻它就会变得不一样\n[01:43.49]\n[01:43.88]啦......\n[01:49.32]变变变 leap frog\n[01:51.61]啦......\n[01:56.26]自信成长 有你相伴 leap frog\n[01:59.60]\n[02:00.05]啦......\n[02:04.11]有你相伴 leap frog\n[02:07.99]啦......\n[02:12.37]自信成长 有你相伴 leap frog\n[02:15.78]\n[02:17.48]快乐的一只小青蛙 leap frog\n[02:21.29]快乐的一只小青蛙 leap frog\n', '371362');

-- ----------------------------
-- Table structure for song_list
-- ----------------------------
DROP TABLE IF EXISTS `song_list`;
CREATE TABLE `song_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `url` varchar(255) DEFAULT NULL,
  `lrc` text,
  `song_id` bigint(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of song_list
-- ----------------------------
INSERT INTO `song_list` VALUES ('10', '曹操', 'song/曹操.mp3', '[00:00.000] 作词 : 林秋离\n[00:01.000] 作曲 : 林俊杰\n[00:02.000]编曲 : Kenn C\n[00:03.000]\n[00:26.847]不是英雄 不读三国\n[00:33.491]若是英雄 怎么能不懂寂寞\n[00:39.701]独自走下长坂坡 月光太温柔\n[00:43.195]曹操不啰嗦 一心要拿荆州\n[00:46.795]用阴谋 阳谋 明说 暗夺的摸\n[00:53.461]东汉末年分三国\n[00:56.535]烽火连天不休\n[01:00.125]儿女情长 被乱世左右\n[01:05.132]谁来煮酒\n[01:06.777]尔虞我诈是三国\n[01:09.854]说不清对与错\n[01:13.444]纷纷扰扰 千百年以后\n[01:18.470]一切又从头\n[01:26.381]\n[01:33.488]不是英雄 不读三国\n[01:40.132]若是英雄 怎么能不懂寂寞\n[01:46.390]独自走下长坂坡 月光太温柔\n[01:49.857]曹操不啰嗦 一心要拿荆州\n[01:53.422]用阴谋 阳谋 明说 暗夺的摸\n[02:00.174]东汉末年分三国\n[02:03.212]烽火连天不休\n[02:06.801]儿女情长 被乱世左右\n[02:11.747]谁来煮酒\n[02:13.444]尔虞我诈是三国\n[02:16.552]说不清对与错\n[02:20.139]纷纷扰扰 千百年以后\n[02:25.139]一切又从头\n[02:31.219]\n[02:39.628]独自走下长坂坡 月光太温柔\n[02:43.173]曹操不啰嗦 一心要拿荆州\n[02:46.753]用阴谋 阳谋 明说 暗夺的谋\n[02:53.440]东汉末年分三国\n[02:56.538]烽火连天不休\n[03:00.111]儿女情长 被乱世左右\n[03:05.068]谁来煮酒\n[03:06.754]尔虞我诈是三国\n[03:09.823]说不清对与错\n[03:13.420]纷纷扰扰 千百年以后\n[03:18.447]一切又从头\n[03:26.743]\n', '26305534');
INSERT INTO `song_list` VALUES ('9', '江南', 'song/江南.mp3', '[00:00.000] 作词 : 林秋离\n[00:00.000] 作曲 : 林俊杰\n[00:00.000]作曲 : 林俊杰\n[00:00.666]作词 : 林秋离\n[00:02.000]编曲 : 蔡政勋 / 陈建玮\n[00:03.000]\n[00:37.010]风到这里就是黏\n[00:40.534]黏住过客的思念\n[00:44.795]雨到了这里缠成线\n[00:48.546]缠着我们流连人世间\n[00:53.038]你在身边就是缘\n[00:56.569]缘分写在三生石上面\n[01:01.023]爱有万分之一甜\n[01:04.546]宁愿我就葬在这一点\n[01:09.062]圈圈圆圆圈圈\n[01:10.739]天天年年天天 的我\n[01:13.546]深深看你的脸\n[01:16.041]生气的温柔\n[01:17.994]埋怨的温柔 的脸\n[01:24.058]不懂爱恨情愁煎熬的我们\n[01:27.737]都以为相爱就像风云的善变\n[01:32.017]相信爱一天 抵过永远\n[01:36.279]在这一刹那冻结了时间\n[01:40.009]不懂怎么表现温柔的我们\n[01:43.760]还以为殉情只是古老的传言\n[01:47.751]离愁能有多痛 痛有多浓\n[01:52.247]当梦被埋在江南烟雨中\n[01:55.506]心碎了才懂\n[01:58.921]\n[02:20.982]圈圈圆圆圈圈\n[02:22.699]天天年年天天 的我\n[02:25.470]深深看你的脸\n[02:27.948]生气的温柔\n[02:29.933]埋怨的温柔 的脸\n[02:35.984]不懂爱恨情愁煎熬的我们\n[02:39.697]都以为相爱就像风云的善变\n[02:43.951]相信爱一天 抵过永远\n[02:48.195]在这一刹那冻结了时间\n[02:51.964]不懂怎么表现温柔的我们\n[02:55.694]还以为殉情只是古老的传言\n[02:59.698]离愁能有多痛 痛有多浓\n[03:04.200]当梦被埋在江南烟雨中\n[03:07.485]心碎了才懂\n[03:11.231]\n[03:19.925]相信爱一天 抵过永远\n[03:24.192]在这一刹那冻结了时间\n[03:27.952]不懂怎么表现温柔的我们\n[03:31.717]还以为殉情只是古老的传言\n[03:35.716]离愁能有多痛 痛有多浓\n[03:40.186]当梦被埋在江南烟雨中\n[03:45.494]心碎了才懂\n[03:49.162]\n[04:02.919]制作人：许环良\n[04:03.291]制作助理：冯时泽\n[04:03.546]箫：林信有\n[04:03.722]吉他：Shah Tahir\n[04:03.940]低音吉他：Gary Lao\n[04:04.135]和声编写：许环良\n[04:04.333]和声：林俊杰\n[04:04.522]录音室：The Garden（新加坡）\n[04:04.721]录音师：许环良、Acid Pang\n[04:04.939]混音室：Blue Moon Studio（加利福尼亚州）\n[04:05.196]混音师：Joe Vanelli、Joe Primeau with 许环良\n[04:05.409]OP：大潮音乐经纪有限公司/Touch Music Publishing Pte Ltd., Compass\n[04:05.569]SP：大潮音乐经纪有限公司\n[04:05.786]ISRC TW-B67-04-01206\n[04:06.278]\n', '26305527');
